
      {
          "name": "RedFlags",
          "categories": [
                {
                
                    "name": "red",
                    "items": [
                      "Se acostó con su padrastro/madrastra",
                      "Es una bandera roja literal. 6ft de altura, listx para la acción, con un bonito y resistente poste",
                      "En la segunda cita te pedirá que entierras un ataúd a las 2am",
                      "\"Ama\" a los animales un poco demasiado",
                      "Tiene una identidad robada",
                      "Tiene montones de teléfonos desechables en su habitación",
                      "Es un traficante de cocaína",
                      "Es un general de guerra, y buscado por crímenes de guerra",
                      "Posee un laboratorio de metanfetaminas",
                      "Aún ama a su ex",
                      "Es líder de una secta",
                      "Odia a tus amigos",
                      "Es anti-vacunas",
                      "No tiene genitales",
                      "Viaja constantemente por negocios",
                      "Es terraplanista",
                      "Ignoró a su última pareja",
                      "Es un fantasma. Literal.",
                      "Está constantemente olvidando tu nombre",
                      "Es analfabeto",
                      "Usa chile como lubricante",
                      "Tiene la \"Lista de asesinos en serie por número de víctimas\" de Wikipedia como favorita",
                      "Te agrega como contacto de emergencia en la primera cita",
                      "Tuvo tu número de teléfono antes de que se conocieran oficialmente",
                      "Es mentiroso compulsivo",
                      "Es completamente ficticio, pero lo amas de todos modos",
                      "Comparte una habitación con ocho chicos",
                      "Ya has salido con él/ella antes... No funcionó la última vez",
                      "Es mitad superior pez",
                      "Es mitad inferior pez",
                      "Solo habla en jerga empresarial",
                      "Se niega a tener sexo en un colchón",
                      "Tiene mal aliento",
                      "Es muy mal besador",
                      "Piensa que es un Jedi",
                      "Súper racista",
                      "Sexista, pero se niega a admitirlo",
                      "Debe mucho dinero al gobierno. No te dirá cuánto",
                      "Es recluso en el corredor de la muerte",
                      "Se siente más atraído por tu hermana/ hermano",
                      "No siente atracción sexual por ti",
                      "Piensa que eres feo",
                      "Su apodo para ti es 'bolsa de basura'",
                      "Siempre está cubierto de hormigas y no cree que sea un problema",
                      "Escupe compulsivamente como una llama cada vez que ve niños",
                      "Solo habla con chistes malos",
                      "Dice que ve fantasmas de todos los que han muerto",
                      "Está literalmente siempre viendo porno",
                      "Es adicto al crack",
                      "Es adicto a los medicamentos recetados",
                      "Es un metiche",
                      "Lee sobre tu hombro (en voz alta)",
                      "Tiene seis años",
                      "Solo habla en sarcasmo",
                      "Se tira pedos cada vez que te besa",
                      "Patea a cada animal que ve",
                      "Se niega a limpiarse por completo",
                      "Es caníbal aficionado",
                      "Está tratando de unirse a una secta, pero la secta no lo quiere",
                      "Practica tortura",
                      "Usa la frase \"De Chill\" en cada oración ",
                      "Solo usa ropa de ahegao",
                      "Tiene múltiples aplicaciones de citas instaladas en su teléfono",
                      "Literalmente no puede tomar decisiones",
                      "Tiene que orinar cada vez que estás a punto de hacer algo sexy",
                      "Vendió tus mascotas en internet",
                      "No puede hablar normalmente, siempre grita",
                      "Constantemente parece estar enojado contigo",
                      "No sabe la diferencia entre \"vaya\", \"baya\" y \"valla\"",
                      "Come crayones",
                      "Tiene una docena de hijos de una docena de parejas",
                      "Está construyendo un arca",
                      "Inhala canela compulsivamente y realmente quiere que lo pruebes",
                      "Solo come si juegas al avión con su comida",
                      "Literalmente siempre está en un monopatín",
                      "Llora hasta quedarse dormido cada noche",
                      "Te lleva a un club de strippers dudoso en la primera citanta tus calorías (en voz alta)puede mantener un trabajo por más de una semana",
                      "Hace un gesto de arcada cada vez que ve tu cara",
                      "Es tu clon",
                      "Bostea cada vez que empiezas una oración",
                      "Su apellido es Hitler. Insistirá en qué tomes su apellido si te casas.",
                      "Todavía está en cuarto grado",
                      "Se teletransporta al Polo Norte cada vez que dice la palabra amor",
                      "Cada vez que piensas en él/ella vomitas",
                      "En la segunda cita te lleva a terapia de pareja",
                      "Solo habla en letras de canciones de reguetón",
                      "Coquetea con cada persona de servicio",
                      "Nunca ha deletreado una palabra correctamente",
                      "Nunque deje de escribirte de este manere, oke?",
                      "Colecciona calaveras humanas. Dice que son \"prácticamente gratis!\"",
                      "Te llama por el nombre de su ex",
                      "Siempre usa un auricular Bluetooth",
                      "Siempre finge hablar con otra persona (incluso si son solo ustedes dos)",
                      "Narra tus acciones en una grabadora de voz. Todo. El. Tiempo.",
                      "Es la persona que más odiabas en la secundaria y literalmente no ha cambiado",
                      "Publica todos tus textos y correos electrónicos en línea",
                      "Sigue preguntando si tu mejor amigo está \"dispuesto\"",
                      "Está constantemente tratando de que te unas a su esquema piramidal",
                      "Solo habla en chileno",
                      "Literalmente no dejará de hablar sobre su madre",
                      "Describe toda la comida como \"yummy yummers\"",
                      "No permite WiFi en la casa",
                      "Insiste en que si se quita su sombrero de papel aluminio, el gobierno robará sus ideas",
                      "Responde a todo diciendo \"eso es lo que ella dijo\"",
                      "Es un asesino en serie, pero lo esconde por qué piensa que lo desaprobarías",
                      "Increíblemente compulsivo",
                      "Solo come comida frita",
                      "Intenta pagar todo con productos agrícolas",
                      "Regularmente organiza fiestas de té para muñecas",
                      "Es la persona viviente más anciana",
                      "Dice \"¿Podrías no...?\" Cada vez que lloras",
                      "Literalmente solo habla de sí mismo",
                      "Solo responde a los mensajes de texto con \"k\"",
                      "Está relacionado contigo",
                      "Incapaz de cualquier emoción",
                      "Es en realidad dos niños apilados uno encima del otro en un abrigo largo",
                      "Menciona nombres durante conversaciones sucias",
                      "Te dice como le gustaba a sus otras parejas durante el sexo",
                      "Te dice que te calmes después de todo lo que dices",
                      "Siempre siente la necesidad de oler su mano después de estrechar la mano de alguien",
                      "Está casado con hijos",
                      "Está constantemente tratando de acostarse con tus amigos",
                      "Tu mejor amigo te ha dicho que es muy bueno en la cama",
                      "Se refiere a sus genitales como su \"untz-untz\"",
                      "Está conectado a una bomba de tiempo",
                      "Olvida convenientemente su cartera cada noche de cita (siempre tiene su identificación)",
                      "Te llama un 4 de 10 en tu cara",
                      "Robo mechones de tu cabello",
                      "Está tratando de clonarte genéticamente",
                      "Piensa que podría estar saliendo contigo para su tarea de psicología",
                      "Repite tus chistes, pero más alto",
                      "Desestima constantemente tu opinión",
                      "Lame compulsivamente las manijas de las puertas antes de abrirlas",
                      "Físicamente incapaz de hacer una pregunta",
                      "Tiene miedo a la luz del sol",
                      "Solo quiere dormir cuando tú quieres hacer algo",
                      "Habla con un acento extranjero que cambia constantemente",
                      "Literalmente siempre está borracho",
                      "Trae a su madre a la primera cita",
                      "Trae a dos amigos a la primera cita",
                      "Está en una banda llamada \"Genuinely Genocidal\"",
                      "Literalmente nunca deja de hablar",
                      "Intenta constantemente matarte (aunque es muy malo en ello)",
                      "Besa a sus mascotas con la boca abierta",
                      "Lo has encontrado tomando fotos de ti mientras duermes",
                      "Besa a sus hermanos con la boca abierta",
                      "Todos con quienes hablas parecen haber dormido con él/ella",
                      "Siempre se está hurgando la nariz",
                      "Solo habla en hashtags",
                      "Exige reventar todos tus granos por ti",
                      "Recita todas las líneas de \"Titanic\" mientras duerme",
                      "Es realmente obsesivo con las teorías de conspiración",
                      "Narra todo lo que hace en voz alta",
                      "Pone \"comillas de aire\" alrededor de \"cada palabra\" que dice",
                      "Derriba cosas de las manos de extraños mientras camina por la calle",
                      "Habla sucio a toda su comida",
                      "Tiene los nombres de todos sus exes tatuados en su cara",
                      "Solo usa ropa hecha de cabello humano",
                      "Usa pañales porque es \"más conveniente\"",
                      "Solo puede hablar en memes de TikTok",
                      "Solo se ríe de sus propios chistes",
                      "Constantemente empieza sus oraciones con \"No soy racista, pero\"",
                      "Constantemente empieza sus oraciones con \"No soy sexista, pero\"",
                      "Recién salió de la cárcel pero no te dirá por qué estuvo",
                      "Es 10 años mayor que tú",
                      "Cincuenta Sombras de Grey es literalmente el único libro que ha leído",
                      "No cree que Nueva Zelanda sea un lugar real",
                      "Te ha estado acosando desde la escuela secundaria",
                      "Tiene 10 años más de lo que tenía en su foto de perfil",
                      "Es vampiro... No del tipo sexy",
                      "Guiña el ojo después de todo lo que dice ;)",
                      "Eyacula abejas",
                      "Solo puede tener orgasmos si toca una araña",
                      "Jura que te ves exactamente como su hermano/a, pero dice \"eso es algo bueno\"",
                      "Termina cada conversación con la frase \"Puedes retirarte\"\"",
                      "Insiste en que lo/ la llames señor/señora",
                      "Vende su vello púbico",
                      "Su video sexual con un sacerdote local acaba de volverse viral",
                      "Solo puede tener conversaciones a través de marionetas",
                      "Promesa de meñique de que es mayor de edad",
                      "Sigue hablando de su \"prima sexy\"",
                      "Habla exclusivamente en emojis",
                      "Siempre presume de conquistas sexuales pasadas",
                      "Usa demasiada lengua",
                      "Realmente no sabe cómo excitarte",
                      "Se niega a cubrirse la cara mientras estornuda",
                      "Se niega a levantar la vista del teléfono",
                      "Sigue hablando de alguien que se parece a ti, ¡pero mejor!",
                      "No entiende tus chistes",
                      "No cree en el sexo oral",
                      "Se ríe maniáticamente durante el sexo",
                      "Durante el sexo en vez de llamarte por tu nombre dice el de sus padres ",
                      "Tuitea en vivo toda tu cita",
                      "Técnicamente no ha terminado con su última pareja aún",
                      "Ha dormido recientemente con uno de tus padres",
                      "Acaba de romper con tu mejor amigo",
                      "Tus amigos realmente lo/ la odian",
                      "Siempre viste como un mimo",
                      "Solo habla en citas motivacionales",
                      "Puede ver a través de la ropa de las personas",
                      "Está constantemente en una dieta de moda u otra",
                      "Te da descargas estáticas cada vez que lo tocas",
                      "Es alérgico a todas tus comidas favoritas",
                      "Osea, ellos dicen \"osea\", de que osea todo el tiempo, ¿okay?",
                      "Comienza cada oración con un \"DE HECHO...\" ☝️🤓",
                      "Recuerda cada uno de tus errores y te los recuerda",
                      "Piensa que es más inteligente que tú, pero realmente no lo es"
                    ]
                  
                },
                {
                
                    "name": "purple",
                    "items": [
                      "Es honesto, incluso si es algo que no quieres oír",
                      "Vive en una piña debajo del mar",
                      "Trabaja en Los Pollos Hermanos",
                      "Trabaja en una tienda de juguetes sexuales",
                      "Tiene manos grandes",
                      "Tiene antebrazos musculosos",
                      "Tiene una espalda musculosa",
                      "Es más atractivo que tú",
                      "Es menos atractivo que tú",
                      "Solo cree en el sexo para la procreación",
                      "Va al terapeuta regularmente",
                      "Se niega a tener sexo seguro",
                      "Tiene un pene enorme",
                      "Tiene senos realmente sexys",
                      "Es bisexual",
                      "Ama los años 80",
                      "Hace velas aromáticas",
                      "Vive en un castillo",
                      "Es increíblemente rico",
                      "Vive fuera de la red",
                      "Le encanta el vino",
                      "Ama los videojuegos",
                      "Quiere esperar hasta después del matrimonio para tener sexo",
                      "Es virgen",
                      "Tiene experiencia... ;)",
                      "Es extremadamente supersticioso",
                      "Grita \"¡Lenguaje!\" cada vez que escucha una mala palabra.",
                      "Es un justiciero aficionado",
                      "Posee múltiples juguetes sexuales",
                      "Te cobra una moneda cada vez que dices una palabra malsonante",
                      "Tiene una granja de remolachas",
                      "Literalmente no te hablará si perteneces a la casa equivocada de Hogwarts",
                      "Súper empalagoso",
                      "Se duerme inmediatamente después del sexo",
                      "Constantemente toma selfies",
                      "Constantemente vloggea tu relación a internet",
                      "Siempre lleva una ukelele en la espalda",
                      "Se niega a usar electricidad que no fue producida de manera sostenible (incluso en público)",
                      "Tiene una colección de cuchillos",
                      "Tiene una colección de armas",
                      "Solo habla en letras de canciones de Disney",
                      "Escribe fanfiction erótica de Bugs Bunny",
                      "Solo se comunica contigo vía fax",
                      "Invierte todo lo que gana en criptomonedas",
                      "Tiene uñas realmente largas",
                      "Es elegible para la Fundación Make-A-Wish",
                      "Se parece y huele justo como tu mamá/papá",
                      "Está convencido de que eres un producto de su imaginación",
                      "Tiene ocho hijos y contando",
                      "Es un hobbit",
                      "Solo come carne",
                      "Es vegetariano",
                      "Es vegano",
                      "Es demasiado estúpido para entender ninguno de tus chistes. Pero siempre te pide que los expliques, en detalle.",
                      "Tiene una zanahoria por nariz y se derrite si se calienta demasiado",
                      "Tiene un gemelo",
                      "Es doble de riesgo",
                      "Es tan atractivo que los extraños lo miran fijamente",
                      "Ama besar",
                      "Quiere tener hijos algún día",
                      "Quiere tener hijos lo antes posible",
                      "Realmente odia a los niños"
                    ]
                  
                },
                {
                
                    "name": "green",
                    "items": [
                      "Es un australiano mamífero semiautomático agente",
                      "No te esconde nada",
                      "Es súper organizado y bien presentado",
                      "Fue una aventura de una noche, pero en realidad es muy dulce",
                      "Te da regalos sorpresas",
                      "Hace dibujos y pinturas bonitas de ti",
                      "Toma fotos realmente buenas de ti",
                      "Sabe exactamente cómo excitarte",
                      "Te hace sentir amado/a",
                      "Piensa que eres la persona más sexy que ha visto",
                      "Te hace sentir sexy",
                      "Te da la confianza para enfrentar tus miedos",
                      "Respeta tus pasatiempos",
                      "Te trata como su igual",
                      "Si está molesto, toma tiempo para calmarse antes de hablar",
                      "Te da espacio para tus pasatiempos y vida social",
                      "No necesita estar constantemente contigo todo el tiempo",
                      "Sabe cómo comprometerse de manera justa",
                      "Es bueno comunicando sus límites",
                      "Distribuye las tareas domésticas de manera equitativa",
                      "Sientes que puedes ser tú mismx con él/ella",
                      "No te juzga si estás teniendo un mal día",
                      "Se alegra de verte, sin importar cómo te ves",
                      "Te escucha cuando dices que estás descontento/a con algo en la relación",
                      "Puedes discutir abiertamente los problemas con él/ella",
                      "Asume la responsabilidad de sus errores",
                      "No te presiona para hacer cosas que no quieres",
                      "Prioriza pasar tiempo contigo",
                      "Realmente hace un esfuerzo por conocer a tus amigos/familia",
                      "Te encuentras sonriendo cuando piensas en él/ella",
                      "Sabe cuándo ser tonto y cuándo ser serio",
                      "Dio voz a tu personaje favorito de un programa de TV",
                      "Siempre ordena después de sí mismo",
                      "¡Puede salvar a las abejas!",
                      "Le gusta probar cosas nuevas durante el sexo",
                      "Es naturalmente sin pelo en los lugares correctos",
                      "Hace que tus padres estén orgullosos de ti",
                      "Hace una taza de té/café realmente buena",
                      "Tiene tu gusto en música",
                      "Puede teletransportarse",
                      "Es heredero de la fortuna de Hershey",
                      "Posee el Halcón Milenario",
                      "Puede ayudarte a alcanzar tus metas de vida",
                      "Es muy bueno mezclando cócteles",
                      "Es modelo de ropa interior",
                      "Te da los mejores abrazos",
                      "Fue a Hogwarts",
                      "Ama a los animales",
                      "Enterraría un cuerpo por ti, sin preguntas",
                      "Sabe cómo arreglar cosas en la casa",
                      "Escribe cartas manuscritas realmente lindas para ti",
                      "Puede hacer que sus manos vibren",
                      "Sabe cómo aceptar un cumplido",
                      "Hace que tu ex esté celoso/a",
                      "Posee tu museo/restaurante favorito",
                      "Posee tu club/bar favorito",
                      "Se lleva bien con tus amigos",
                      "Te da múltiples orgasmos",
                      "Le gusta abrazar tanto (o tan poco) como tú",
                      "Tiene los _ más atractivos que has visto",
                      "Huele muy bien",
                      "Es fielmente leal",
                      "Cree que eres la persona más atractiva que ha visto",
                      "Confía en ti y siempre asume que tienes buenas intenciones",
                      "Te respeta mucho por tus logros",
                      "Respeta tus límites, sin preguntas",
                      "Es increíblemente honesto; nunca miente ni esconde algo de ti",
                      "Es paciente, y no le importa si necesitas más tiempo",
                      "Es confiable, y puedes contar con él/ella para estar ahí cuando lo necesitas",
                      "Te hace reír cuando están juntx",
                      "Le gusta prepararte comida y snacks cuando estás ocupadx",
                      "Es muy buen oyente, y sientes que siempre puedes hablar con él/ella",
                      "Te apoya emocionalmente",
                      "Te anima a alcanzar tus sueños",
                      "Es realmente generoso/a y siempre ofrece ayudarte",
                      "Es una pareja realmente generosa (en la cama)",
                      "Es increíblemente motivado/a para alcanzar sus metas en la vida. Está avanzando.",
                      "Siempre hace tiempo para ti",
                      "Siempre te da regalos muy considerados",
                      "Cantidad perfecta de afecto físico",
                      "Aventurerx",
                      "Te ama incondicionalmente",
                      "Está en sintonía con sus sentimientos",
                      "Tus padres lo/a aman",
                      "Se lleva bien con tu grupo de amigos",
                      "Posee una alfombra mágica",
                      "Es voluntario/a con personas mayores",
                      "Es voluntario/a en refugios de animales",
                      "Tiene entradas en primera fila para cada concierto",
                      "Tiene entradas en primera fila para cada evento deportivo",
                      "Ama el aire libre",
                      "Ama quedarse en casa y tener un día tranquilo",
                      "Ama a los niños",
                      "Es la persona más físicamente atractiva que has visto",
                      "Posee un viñedo",
                      "Posee una adorable cafetería",
                      "Vive en la playa",
                      "Tiene una bolsa mágica que contiene queso ilimitado",
                      "Tiene un vaso de pinta mágica que contiene cerveza ilimitada",
                      "Posee un yate de 100 metros",
                      "Posee una isla en las Bahamas",
                      "Posee tu equipo deportivo favorito",
                      "Tiene una suite en tu ciudad favorita ",
                      "Dona millones a tu caridad favorita",
                      "Posee una máquina del tiempo",
                      "Tiene el mejor cabello",
                      "Posee un unicornio",
                      "CI de nivel genio",
                      "Posee una start-up exitosa",
                      "Mejor sexo de todx",
                      "Puede llevarte literalmente a cualquier lugar",
                      "Nunca tendrás que trabajar mientras sales con él/ella",
                      "Nunca te enfermarás mientras sales con él/ella",
                      "Literalmente no envejecerás mientras sales con él/ella",
                      "Siempre huele a ___",
                      "Habla todos los idiomas románticos",
                      "Es un/a profesional ___",
                      "Sabe todo sobre ___",
                      "Nunca aumentarás de peso mientras sales con él/ella",
                      "Tiene un ganso que se viste con ropa de diseñador ",
                      "Tiene una bodega llena de ___",
                      "Es surfista profesional",
                      "Es científico de cohetes",
                      "Es modelo",
                      "Es jugador de fútbol profesional",
                      "Es artista famoso",
                      "Es bombero",
                      "Es astronauta",
                      "Es presidente",
                      "Es campeón de rodeo",
                      "Es luchador profesional",
                      "Es estrella de cine famosa",
                      "Es músico famoso",
                      "Es rapero famoso",
                      "Es estrella porno",
                      "Es supermodelo",
                      "Es chef profesional",
                      "Es el mejor estilista de cabello del mundo",
                      "Es CEO",
                      "Es neurocirujano",
                      "Es abogado",
                      "Es el mejor ejecutivo de publicidad del mundo",
                      "Es piloto de aerolínea",
                      "Es Marine",
                      "Es instructor de spinning",
                      "Es autor bestseller",
                      "Es celebridad de YouTube",
                      "Es leñador",
                      "Es agricultor orgánico",
                      "Es doble de riesgo",
                      "Es guardabosques",
                      "Es instructor de esquí",
                      "Es fotógrafo",
                      "Es diseñador de moda famoso",
                      "Es de la realeza",
                      "Es un genio",
                      "Es el cantante principal de tu banda favorita",
                      "Es gimnasta olímpico",
                      "Es instructor de yoga",
                      "Es cazador campeón mundial",
                      "Ganó la medalla de honor",
                      "Is never gonna give you up / Let you down / Run around / Or desert you",
                      "Estuvo en las noticias por rescatar a un gatito",
                      "Es el barista atractivo de tu cafetería favorita",
                      "Tiene un abdomen de 8-pack",
                      "Nunca llega antes de tiempo ;)",
                      "Es vampiro... del tipo sexy",
                      "Tiene ojos hermosos en los que puedes perderte",
                      "Es completamente ciego a todos tus defectos",
                      "Es espontáneo y divertido",
                      "Te hace sentir seguro/a",
                      "Te hace sentir a salvo",
                      "Tiene sudaderas muy cómodas",
                      "Puedes robar su ropa y está bien con eso",
                      "Tiene los amigos más atractivos",
                      "Puede volar",
                      "Es superhéroe",
                      "Cocina todas tus comidas favoritas",
                      "Sabe todas las palabras de tus canciones de TV infantiles favoritas",
                      "Nunca te culpa por nada",
                      "Puede conseguirte bebidas gratis en cualquier bar del mundo",
                      "Crea refugios para las personas sin hogar",
                      "Es un/a gran conversador/a",
                      "Te da los mejores abrazos",
                      "Siempre sabe cómo animarte cuando estás triste",
                      "Es un/a bailarín/a increíble",
                      "Puede conseguirte una mesa en cualquier restaurante en cualquier momento y lugar",
                      "Sus pedos huelen a flores",
                      "Nunca se tira pedos",
                      "Su aliento de la mañana huele a galletas recién horneadas",
                      "Posee Marte",
                      "Es persona nocturna y matutina",
                      "Ama su trabajo",
                      "Tiene todos los mismos pasatiempos que tú",
                      "Puede hablar con los animales",
                      "Da excelentes masajes"

                      ]
                  
                }
            ]
        }


  